<script setup>
  import { defineComponent } from 'vue';
</script>

<template>
  <slot name="header"></slot>
  <section class="text-page">
    <div class="container">
      <div class="text-page__content">
        <div class="page-header__breadcrumbs">
          <div class="page-header__breadcrumb page-header__breadcrumb-main" @click="$router.push({name: 'home'})">Главная</div>
          <span class="page-header__breadcrumb-separator">/</span>
          <div class="page-header__breadcrumb">Текстовая страница</div>
        </div>
        <div class="page-header__top">
          <h3 class="page-header__title">Текстовая страница</h3>
        </div>
        <div class="text-page-content__text">
          <p class="text-page-content__descr">
            Приветствуем вас в нашем уютном ресторане! Здесь вы окунетесь
            в неповторимую атмосферу вкусов и ароматов. Наше меню вдохновлено традиционной и
            современной кухней, предлагая богатый выбор блюд для любого вкуса. Каждое блюдо –
            это творение наших поваров, готовленное с любовью и уважением к деталям. Приходите
            и насладитесь гастрономическим путешествием, которое оставит незабываемые впечатления.
          </p>
          <p class="text-page-content__descr">
            Приветствуем вас в нашем уютном ресторане! Здесь вы окунетесь
            в неповторимую атмосферу вкусов и ароматов. Наше меню вдохновлено традиционной и
            современной кухней, предлагая богатый выбор блюд для любого вкуса. Каждое блюдо –
            это творение наших поваров, готовленное с любовью и уважением к деталям. Приходите
            и насладитесь гастрономическим путешествием, которое оставит незабываемые впечатления.
          </p>
          <p class="text-page-content__descr">
            Приветствуем вас в нашем уютном ресторане! Здесь вы окунетесь
            в неповторимую атмосферу вкусов и ароматов. Наше меню вдохновлено традиционной и
            современной кухней, предлагая богатый выбор блюд для любого вкуса. Каждое блюдо –
            это творение наших поваров, готовленное с любовью и уважением к деталям. Приходите
            и насладитесь гастрономическим путешествием, которое оставит незабываемые впечатления.
          </p>
          <p class="text-page-content__descr">
            Приветствуем вас в нашем уютном ресторане! Здесь вы окунетесь
            в неповторимую атмосферу вкусов и ароматов. Наше меню вдохновлено традиционной и
            современной кухней, предлагая богатый выбор блюд для любого вкуса. Каждое блюдо –
            это творение наших поваров, готовленное с любовью и уважением к деталям. Приходите
            и насладитесь гастрономическим путешествием, которое оставит незабываемые впечатления.
          </p>
        </div>
      </div>
    </div>
  </section>
  <slot name="footer"></slot>
</template>